holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
        case KB_MATRIX_OUTPUT_PWM_1:
            if (strval_validate(ctx->strval_type, input)) {
                uint32_t val = strtoul(input, NULL, 10);
                printf("[keyboard_event_cb] Setting MATRIX_OUTPUT_PWM_1 to: %lu\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                matrixData.output_pwm[0][current_matrix_i][INDEX_MATRIX_SWITCH_PWM_ON] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid uint32_t: %s\n", input);
            }
            break;
        
        case KB_MATRIX_PORT_MAP:
            if (strval_validate(ctx->strval_type, input)) {
                int16_t val = atoi(input);
                printf("[keyboard_event_cb] Setting MATRIX_PORT_MAP to: %d\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                matrixData.matrix_port_map[0][current_matrix_i] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid int8_t: %s\n", input);
            }
            break;
        
        case KB_MAPPING_C1:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                printf("[keyboard_event_cb] Setting KB_MAPPING_C1 to: %ld\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C1] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid int32_t: %s\n", input);
            }
            break;
        
        case KB_MAPPING_C2:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                printf("[keyboard_event_cb] Setting KB_MAPPING_C2 to: %ld\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C2] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid int32_t: %s\n", input);
            }
            break;

        case KB_MAPPING_C3:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                printf("[keyboard_event_cb] Setting KB_MAPPING_C3 to: %ld\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C3] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid int32_t: %s\n", input);
            }
            break;

        case KB_MAPPING_C4:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                printf("[keyboard_event_cb] Setting KB_MAPPING_C4 to: %ld\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C4] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid int32_t: %s\n", input);
            }
            break;

        case KB_MAPPING_C5:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                printf("[keyboard_event_cb] Setting KB_MAPPING_C5 to: %ld\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C5] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid int32_t: %s\n", input);
            }
            break;
        
        default:
            printf("[keyboard_event_cb] No case for context target: %d\n", ctx->target);
            break;
    }

    // Cleanup
    lv_textarea_set_text(kb_user_data->ta, "");
    lv_obj_add_flag(kb_user_data->kb, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(kb_user_data->ta, LV_OBJ_FLAG_HIDDEN);
    lv_obj_set_user_data(kb_user_data->ta, NULL);  // Clear tracking
}

/** ---------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void screen_swipe_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    lv_obj_t * target = (lv_obj_t *)lv_event_get_target(e);
    lv_dir_t dir = lv_indev_get_gesture_dir(lv_indev_get_act());

    // Get gesture start position
    lv_point_t gesture_point;
    lv_indev_get_point(lv_indev_get_act(), &gesture_point);
    printf("[screen_swipe_cb] x=%lu, y=%lu\n", gesture_point.x, gesture_point.y);

    // ---- Handle special cases first ----

    // Hide keyboard if gesture outside keyboard area
    // if (
    //         target != kb_alnumsym.kb &&
    //         target != kb_alnumsym.ta &&
    //         target != kb_numdec.kb   &&
    //         target != kb_numdec.ta
    //     ) {
    //     printf("[screen_swipe_cb] attempting to hide keyboard(s)\n");
    //     lv_obj_add_flag(kb_alnumsym.kb, LV_OBJ_FLAG_HIDDEN);
    //     lv_obj_add_flag(kb_alnumsym.ta, LV_OBJ_FLAG_HIDDEN);
    //     lv_obj_add_flag(kb_numdec.kb, LV_OBJ_FLAG_HIDDEN);
    //     lv_obj_add_flag(kb_numdec.ta, LV_OBJ_FLAG_HIDDEN);
    // }

