holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
        if (btn_index <= 44) {current_matrix_i = btn_index;}
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_function_index_select_event_cb(lv_event_t * e) 
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        current_matrix_function_i = (int)sel;
        printf("[dd_function_index_select_event_cb] Function index set to: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_switch_index_select_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        current_matrix_i = (int)sel;
        printf("[dd_switch_index_select_event_cb] Switch index set to: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_current_map_slot_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        current_mapping_i = (int)sel;
        printf("[dd_current_map_slot_event_cb] Map slot index set to: %ld\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_function_name_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        matrixData.matrix_function[0][current_matrix_i][current_matrix_function_i] = (int)sel;
        printf("[dd_function_name_event_cb] Function set to: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_c0_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C0] = (int)sel;
        printf("[dd_c0_event_cb] Set map function: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_mode_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        mappingData.map_mode[0][matrixData.index_mapped_value[0][current_matrix_i]] = (int)sel;
        printf("[dd_mode_event_cb] Set map mode: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_mode_x_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        // Safety: Reset to 0
        matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]=0;
        // Set mode
        matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X] = (int)sel;
        printf("[dd_mode_x_event_cb] Set mode x: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_mode_y_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        // Safety: Reset to 0
        matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]=0;
        // Set mode
        matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y] = (int)sel;
        printf("[dd_mode_y_event_cb] Set mode y: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_mode_z_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        // Safety: Reset to 0
        matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]=0;
        // Set mode
        matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z] = (int)sel;
        printf("[dd_mode_z_event_cb] Set mode z: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_inverted_logic_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        // Set mode
        matrixData.matrix_switch_inverted_logic[0][current_matrix_i][current_matrix_function_i] = (int)sel;
        printf("[dd_inverted_logic_event_cb] Set switch standard/inverted: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_x_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X] = (int)sel;
        printf("[dd_x_event_cb] Function X set to value index: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_y_event_cb dropdown.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_y_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y] = (int)sel;
        printf("[dd_y_event_cb] Function Y set to value index: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_z_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z] = (int)sel;
        printf("[dd_z_event_cb] Function Z set to value index: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_operator_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        matrixData.matrix_switch_operator_index[0][current_matrix_i][current_matrix_function_i] = (int)sel;
        printf("[dd_operator_event_cb] Operator set to: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_output_mode_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        matrixData.output_mode[0][current_matrix_i] = (int)sel;
        printf("[dd_output_mode_event_cb] Output mode set to: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_matrix_file_slot_select_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        memset(satioFileData.current_matrix_filepath, 0, sizeof(satioFileData.current_matrix_filepath));
        lv_dropdown_get_selected_str(dd_matrix_file_slot_select, satioFileData.current_matrix_filepath, sizeof(satioFileData.current_matrix_filepath));
        // strcpy(satioFileData.current_matrix_filepath, lv_dropdown_get_selected_str(dd_matrix_file_slot_select));
        printf("[dd_matrix_file_slot_select_event_cb] Matrix slot set to: %s\n", satioFileData.current_matrix_filepath);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_link_map_slot_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        matrixData.index_mapped_value[0][current_matrix_i] = (int)sel;
        printf("[dd_link_map_slot_event_cb] Matrix %d will use map slot: %ld\n", current_matrix_i, sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void matrix_new_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[matrix_new_event_cb] event code: %d\n", code);}

