holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_6, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_6, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_6, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_6, LV_DIR_NONE);

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding * 4;

    result.lbl_utc_date = create_label(
        row_6,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "UTC Date",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_utc_date = create_label(
        row_6,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_utc_date, label_width_0, obj_height);
    lv_obj_set_size(result.val_utc_date, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 7: Installation Angle                                  */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_7 = lv_obj_create(result.panel);
    lv_obj_set_size(row_7, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_7, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_7, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_7, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_7, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_7, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_7,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_7, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_7, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_7, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_7, LV_DIR_NONE);

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding * 4;

    result.lbl_installation_angle = create_label(
        row_7,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Inst Angle",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_installation_angle = create_label(
        row_7,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_installation_angle, label_width_0, obj_height);
    lv_obj_set_size(result.val_installation_angle, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 8: Installation Angle Direction                        */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_8 = lv_obj_create(result.panel);
    lv_obj_set_size(row_8, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_8, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_8, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_8, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_8, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_8, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_8,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_8, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_8, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_8, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_8, LV_DIR_NONE);

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding * 4;

    result.lbl_installation_angle_direction = create_label(
        row_8,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Inst Dir",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_installation_angle_direction = create_label(
        row_8,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_installation_angle_direction, label_width_0, obj_height);
    lv_obj_set_size(result.val_installation_angle_direction, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 9: Mode Indication                                     */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_9 = lv_obj_create(result.panel);
    lv_obj_set_size(row_9, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_9, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_9, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_9, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_9, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_9, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_9,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

