holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    if (show_scrollbar) { lv_obj_set_scrollbar_mode(row_18, LV_SCROLLBAR_MODE_AUTO); }
    else { lv_obj_set_scrollbar_mode(row_18, LV_SCROLLBAR_MODE_OFF); }

    if (enable_scrolling) { lv_obj_set_scroll_dir(row_18, LV_DIR_ALL); }
    else { lv_obj_set_scroll_dir(row_18, LV_DIR_NONE); }

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding * 4;

    result.lbl_speed_num = create_label(
        row_18,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Speed Num",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_speed_num = create_label(
        row_18,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_speed_num, label_width_0, obj_height);
    lv_obj_set_size(result.val_speed_num, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 19: Scalable                                           */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_19 = lv_obj_create(result.panel);
    lv_obj_set_size(row_19, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_19, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_19, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_19, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_19, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_19, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(
        row_19,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    if (show_scrollbar) { lv_obj_set_scrollbar_mode(row_19, LV_SCROLLBAR_MODE_AUTO); }
    else { lv_obj_set_scrollbar_mode(row_19, LV_SCROLLBAR_MODE_OFF); }

    if (enable_scrolling) { lv_obj_set_scroll_dir(row_19, LV_DIR_ALL); }
    else { lv_obj_set_scroll_dir(row_19, LV_DIR_NONE); }

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding * 4;

    result.lbl_scalable = create_label(
        row_19,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Scalable",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_scalable = create_label(
        row_19,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_scalable, label_width_0, obj_height);
    lv_obj_set_size(result.val_scalable, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 20: Bad Elements                                       */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_20 = lv_obj_create(result.panel);
    lv_obj_set_size(row_20, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_20, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_20, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_20, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_20, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_20, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(
        row_20,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    if (show_scrollbar) { lv_obj_set_scrollbar_mode(row_20, LV_SCROLLBAR_MODE_AUTO); }
    else { lv_obj_set_scrollbar_mode(row_20, LV_SCROLLBAR_MODE_OFF); }

    if (enable_scrolling) { lv_obj_set_scroll_dir(row_20, LV_DIR_ALL); }
    else { lv_obj_set_scroll_dir(row_20, LV_DIR_NONE); }

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding * 4;

    result.lbl_bad_element_count = create_label(
        row_20,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Bad Elements",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_bad_element_count = create_label(
        row_20,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_bad_element_count, label_width_0, obj_height);
    lv_obj_set_size(result.val_bad_element_count, value_width_0, obj_height);

    return result;
}

satio_container_t create_satio_panel(
    lv_obj_t * scr,
    int32_t width_px,
    int32_t height_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    int32_t radius,
    int32_t padding,
    int32_t row_height,
    int32_t row_spacing,
    bool show_scrollbar,
    bool enable_scrolling,
    const lv_font_t * font_title,
    const lv_font_t * font_sub
)
{
    satio_container_t result = {0};

    int32_t label_width_0 = 200;
    int32_t value_width_0 = (width_px - label_width_0) - padding * 4;
    int32_t obj_height = row_height - 6;

    /* --- MAIN PANEL ------------------------------------------------------------------ */

    result.panel = lv_obj_create(scr);
    lv_obj_set_size(result.panel, width_px, height_px);
    lv_obj_align(result.panel, alignment, pos_x, pos_y);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(result.panel, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(result.panel, LV_DIR_NONE);

    lv_obj_set_style_radius(result.panel, general_radius, LV_PART_MAIN);
    lv_obj_set_style_outline_width(result.panel, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.panel, default_outline_hue, LV_PART_MAIN);
    lv_obj_set_style_border_width(result.panel, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.panel, default_border_hue, LV_PART_MAIN);
    lv_obj_set_style_bg_color(result.panel, default_bg_hue, LV_PART_MAIN);
    lv_obj_set_style_pad_all(result.panel, padding, LV_PART_MAIN);
    lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_AUTO);
    lv_obj_set_flex_flow(result.panel, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(result.panel,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_START);
    lv_obj_set_style_pad_column(result.panel, padding, LV_PART_MAIN);
    lv_obj_set_style_pad_row(result.panel, row_spacing, LV_PART_MAIN);
    lv_obj_set_style_radius(result.panel, radius, LV_PART_MAIN);
    lv_obj_set_style_outline_pad(result.panel, padding, LV_PART_MAIN);

    /* ---------------------------------------------------------- */
    /* Row 0: Local Year Day                                      */
    /* ---------------------------------------------------------- */

