holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_t * row_0 = lv_obj_create(result.panel);
    lv_obj_set_size(row_0, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_0, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_0, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_0, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_0, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_0, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_0,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_0, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_0, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_0, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_0, LV_DIR_NONE);

    result.lbl_local_yday = create_label(
        row_0,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Local YDay",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_local_yday = create_label(
        row_0,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_local_yday, label_width_0, obj_height);
    lv_obj_set_size(result.val_local_yday, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 1: Local Weekday Name                                  */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_1 = lv_obj_create(result.panel);
    lv_obj_set_size(row_1, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_1, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_1, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_1, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_1, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_1, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_1,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_1, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_1, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_1, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_1, LV_DIR_NONE);

    result.lbl_local_wday_name = create_label(
        row_1,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Weekday",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_local_wday_name = create_label(
        row_1,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_local_wday_name, label_width_0, obj_height);
    lv_obj_set_size(result.val_local_wday_name, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 2: Local Month Name                                    */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_2 = lv_obj_create(result.panel);
    lv_obj_set_size(row_2, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_2, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_2, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_2, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_2, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_2, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_2,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_2, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_2, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_2, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_2, LV_DIR_NONE);

    result.lbl_local_month_name = create_label(
        row_2,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Month",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_local_month_name = create_label(
        row_2,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_local_month_name, label_width_0, obj_height);
    lv_obj_set_size(result.val_local_month_name, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 3: Formatted Local Time                                */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_3 = lv_obj_create(result.panel);
    lv_obj_set_size(row_3, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_3, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_3, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_3, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_3, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_3, padding, LV_PART_MAIN);

