holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    result.val_formatted_rtc_time = create_label(
        row_11,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_formatted_rtc_time, label_width_0, obj_height);
    lv_obj_set_size(result.val_formatted_rtc_time, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 12: Formatted RTC Date                                 */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_12 = lv_obj_create(result.panel);
    lv_obj_set_size(row_12, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_12, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_12, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_12, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_12, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_12, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_12,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_12, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_12, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_12, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_12, LV_DIR_NONE);

    result.lbl_formatted_rtc_date = create_label(
        row_12,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC Date",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_formatted_rtc_date = create_label(
        row_12,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_formatted_rtc_date, label_width_0, obj_height);
    lv_obj_set_size(result.val_formatted_rtc_date, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 13: RTC Unix Time                                      */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_13 = lv_obj_create(result.panel);
    lv_obj_set_size(row_13, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_13, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_13, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_13, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_13, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_13, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_13,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_13, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_13, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_13, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_13, LV_DIR_NONE);

    result.lbl_rtc_unixtime = create_label(
        row_13,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC Unix",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_rtc_unixtime = create_label(
        row_13,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_rtc_unixtime, label_width_0, obj_height);
    lv_obj_set_size(result.val_rtc_unixtime, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 14: UTC Second Offset                                  */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_14 = lv_obj_create(result.panel);
    lv_obj_set_size(row_14, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_14, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_14, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_14, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_14, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_14, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_14,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_14, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_14, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_14, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_14, LV_DIR_NONE);

    result.lbl_utc_second_offset = create_label(
        row_14,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "UTC Offset (s)",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_utc_second_offset = create_label(
        row_14,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_utc_second_offset, label_width_0, obj_height);
    lv_obj_set_size(result.val_utc_second_offset, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 15: UTC Auto Offset Flag                               */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_15 = lv_obj_create(result.panel);
    lv_obj_set_size(row_15, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_15, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_15, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_15, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_15, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_15, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_15,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

