holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_15, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_15, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_15, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_15, LV_DIR_NONE);

    result.lbl_utc_auto_offset_flag = create_label(
        row_15,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Auto UTC Offset",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_utc_auto_offset_flag = create_label(
        row_15,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_utc_auto_offset_flag, label_width_0, obj_height);
    lv_obj_set_size(result.val_utc_auto_offset_flag, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 16: Set Time Automatically                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_16 = lv_obj_create(result.panel);
    lv_obj_set_size(row_16, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_16, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_16, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_16, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_16, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_16, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_16,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_16, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_16, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_16, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_16, LV_DIR_NONE);

    result.lbl_set_time_automatically = create_label(
        row_16,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Auto Time Set",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_set_time_automatically = create_label(
        row_16,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_set_time_automatically, label_width_0, obj_height);
    lv_obj_set_size(result.val_set_time_automatically, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 17: Altitude                                           */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_17 = lv_obj_create(result.panel);
    lv_obj_set_size(row_17, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_17, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_17, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_17, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_17, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_17, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_17,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_17, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_17, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_17, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_17, LV_DIR_NONE);

    result.lbl_altitude = create_label(
        row_17,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Altitude",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_altitude = create_label(
        row_17,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_altitude, label_width_0, obj_height);
    lv_obj_set_size(result.val_altitude, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 18: Altitude Converted                                 */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_18 = lv_obj_create(result.panel);
    lv_obj_set_size(row_18, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_18, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_18, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_18, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_18, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_18, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_18,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_18, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_18, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_18, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_18, LV_DIR_NONE);

    result.lbl_altitude_converted = create_label(
        row_18,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Alt Converted",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

