holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    result.val_altitude_converted = create_label(
        row_18,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_altitude_converted, label_width_0, obj_height);
    lv_obj_set_size(result.val_altitude_converted, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 19: Altitude Unit Mode                                 */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_19 = lv_obj_create(result.panel);
    lv_obj_set_size(row_19, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_19, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_19, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_19, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_19, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_19, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_19,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_19, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_19, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_19, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_19, LV_DIR_NONE);

    result.lbl_altitude_unit_mode = create_label(
        row_19,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Alt Unit",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_altitude_unit_mode = create_label(
        row_19,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_altitude_unit_mode, label_width_0, obj_height);
    lv_obj_set_size(result.val_altitude_unit_mode, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 20: Altitude Conversion Mode                           */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_20 = lv_obj_create(result.panel);
    lv_obj_set_size(row_20, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_20, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_20, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_20, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_20, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_20, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_20,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_20, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_20, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_20, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_20, LV_DIR_NONE);

    result.lbl_altitude_conversion_mode = create_label(
        row_20,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Alt Conv Mode",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_altitude_conversion_mode = create_label(
        row_20,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_altitude_conversion_mode, label_width_0, obj_height);
    lv_obj_set_size(result.val_altitude_conversion_mode, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 21: Speed                                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_21 = lv_obj_create(result.panel);
    lv_obj_set_size(row_21, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_21, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_21, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_21, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_21, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_21, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_21,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_21, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_21, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_21, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_21, LV_DIR_NONE);

    result.lbl_speed = create_label(
        row_21,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Speed",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_speed = create_label(
        row_21,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_speed, label_width_0, obj_height);
    lv_obj_set_size(result.val_speed, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 22: Speed Converted                                    */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_22 = lv_obj_create(result.panel);
    lv_obj_set_size(row_22, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_22, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_22, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_22, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_22, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_22, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_22,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_22, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_22, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_22, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_22, LV_DIR_NONE);

