holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    result.lbl_speed_converted = create_label(
        row_22,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Speed Conv",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_speed_converted = create_label(
        row_22,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_speed_converted, label_width_0, obj_height);
    lv_obj_set_size(result.val_speed_converted, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 23: Speed Unit Mode                                    */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_23 = lv_obj_create(result.panel);
    lv_obj_set_size(row_23, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_23, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_23, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_23, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_23, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_23, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_23,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_23, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_23, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_23, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_23, LV_DIR_NONE);

    result.lbl_speed_unit_mode = create_label(
        row_23,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Speed Unit",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_speed_unit_mode = create_label(
        row_23,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_speed_unit_mode, label_width_0, obj_height);
    lv_obj_set_size(result.val_speed_unit_mode, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 24: Speed Conversion Mode                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_24 = lv_obj_create(result.panel);
    lv_obj_set_size(row_24, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_24, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_24, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_24, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_24, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_24, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_24,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_24, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_24, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_24, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_24, LV_DIR_NONE);

    result.lbl_speed_conversion_mode = create_label(
        row_24,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Speed Conv Mode",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_speed_conversion_mode = create_label(
        row_24,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_speed_conversion_mode, label_width_0, obj_height);
    lv_obj_set_size(result.val_speed_conversion_mode, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 25: Ground Heading Name                                */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_25 = lv_obj_create(result.panel);
    lv_obj_set_size(row_25, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_25, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_25, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_25, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_25, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_25, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_25,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_25, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_25, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_25, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_25, LV_DIR_NONE);

    result.lbl_ground_heading_name = create_label(
        row_25,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Heading Name",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

