holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    result.val_ground_heading_name = create_label(
        row_25,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_ground_heading_name, label_width_0, obj_height);
    lv_obj_set_size(result.val_ground_heading_name, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 26: Ground Heading                                     */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_26 = lv_obj_create(result.panel);
    lv_obj_set_size(row_26, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_26, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_26, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_26, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_26, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_26, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_26,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_26, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_26, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_26, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_26, LV_DIR_NONE);

    result.lbl_ground_heading = create_label(
        row_26,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Heading",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_ground_heading = create_label(
        row_26,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_ground_heading, label_width_0, obj_height);
    lv_obj_set_size(result.val_ground_heading, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 27: Ground Heading Mode                                */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_27 = lv_obj_create(result.panel);
    lv_obj_set_size(row_27, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_27, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_27, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_27, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_27, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_27, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_27,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_27, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_27, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_27, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_27, LV_DIR_NONE);

    result.lbl_ground_heading_mode = create_label(
        row_27,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Heading Mode",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_ground_heading_mode = create_label(
        row_27,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_ground_heading_mode, label_width_0, obj_height);
    lv_obj_set_size(result.val_ground_heading_mode, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 28: Mileage                                            */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_28 = lv_obj_create(result.panel);
    lv_obj_set_size(row_28, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_28, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_28, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_28, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_28, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_28, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_28,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_28, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_28, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_28, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_28, LV_DIR_NONE);

    result.lbl_mileage = create_label(
        row_28,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Mileage",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_mileage = create_label(
        row_28,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

