holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_set_flex_align(row_3,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_3, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_3, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_3, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_3, LV_DIR_NONE);

    result.lbl_gyro_0_acc_x = create_label(
        row_3,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "G-Force X",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_acc_x = create_label(
        row_3,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_acc_x, label_width_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_acc_x, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 4: Acc Y                                               */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_4 = lv_obj_create(result.panel);
    lv_obj_set_size(row_4, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_4, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_4, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_4, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_4, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_4, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_4,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_4, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_4, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_4, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_4, LV_DIR_NONE);

    result.lbl_gyro_0_acc_y = create_label(
        row_4,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "G-Force Y",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_acc_y = create_label(
        row_4,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_acc_y, label_width_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_acc_y, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 5: Acc Z                                               */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_5 = lv_obj_create(result.panel);
    lv_obj_set_size(row_5, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_5, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_5, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_5, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_5, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_5, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_5,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_5, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_5, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_5, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_5, LV_DIR_NONE);

    result.lbl_gyro_0_acc_z = create_label(
        row_5,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "G-Force Z",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_acc_z = create_label(
        row_5,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_acc_z, label_width_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_acc_z, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 6: Gyro X (processed)                                  */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_6 = lv_obj_create(result.panel);
    lv_obj_set_size(row_6, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_6, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_6, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_6, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_6, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_6, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_6,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_6, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_6, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_6, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_6, LV_DIR_NONE);

    result.lbl_gyro_0_gyr_x = create_label(
        row_6,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Gyro X",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_gyr_x = create_label(
        row_6,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_gyr_x, label_width_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_gyr_x, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 7: Gyro Y                                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_7 = lv_obj_create(result.panel);
    lv_obj_set_size(row_7, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_7, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_7, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_7, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_7, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_7, padding, LV_PART_MAIN);

