holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_t * row_switches_0 = lv_obj_create(result.panel);
    lv_obj_set_size(row_switches_0, LV_PCT(100), row_height+(row_height/4));
    lv_obj_set_flex_flow(row_switches_0, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_switches_0, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_switches_0, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_switches_0, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_switches_0, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_switches_0,
        LV_FLEX_ALIGN_CENTER,  // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_switches_0, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_switches_0, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_switches_0, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_switches_0, LV_DIR_NONE);}

    // Computer Assist Toggle
    result.matrix_switch_computer_assist = create_button(
        row_switches_0,       // parent
        80,                   // width px
        obj_height,           // height px
        LV_ALIGN_BOTTOM_MID,  // alignment
        20,                   // pos x
        0,                    // pos y
        "ASSIST",             // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded
    );
    lv_obj_add_event_cb(result.matrix_switch_computer_assist.button, current_matrix_computer_assist_event_cb, LV_EVENT_ALL, NULL);

    // Output Value
    result.matrix_switch_output_value = create_label(
        row_switches_0,       // parent
        170,                  // width
        obj_height,           // height
        LV_ALIGN_BOTTOM_MID,  // parent alignment
        0,                    // pos x
        0,                    // pos y
        "0",                  // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        radius_rounded,       // outline radius
        1
    );

    // Matrix Switch Override
    result.matrix_switch_override = create_button(
        row_switches_0,       // parent
        100,                  // width px
        obj_height,           // height px
        LV_ALIGN_BOTTOM_MID,  // alignment
        -20,                  // pos x
        0,                    // pos y
        "OVERRIDE",           // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded
    );
    lv_obj_add_event_cb(result.matrix_switch_override.button, current_matrix_override_off_event_cb, LV_EVENT_ALL, NULL);
    
    return result;
}

/** ----------------------------------------------------------------------------------------
 * @brief Create Mapping Configuration Container
 * 
 * Creates a container panel with all elements needed to display/edit matrix function data:
 * - Map Slot
 * - Configuration 0
 * - Configuration 1
 * - Configuration 2
 * - Configuration 3
 * - Configuration 4
 * - Configuration 5
 * - Map Mode
 * 
 * @param scr Pointer to the parent screen object.
 * @param width_px Width of the container in pixels.
 * @param height_px Height of the container in pixels.
 * @param alignment Alignment of the container within its parent/screen.
 * @param pos_x X position of the container.
 * @param pos_y Y position of the container.
 * @return mapping_config_container_t struct with all UI element pointers.
 */
mapping_config_container_t create_mapping_config_container(
    lv_obj_t * scr,
    int32_t width_px,
    int32_t height_px,
    int32_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    int32_t radius,
    int32_t padding,
    int32_t row_height,
    int32_t row_spacing,
    bool show_scrollbar,
    bool enable_scrolling,
    const lv_font_t * font_title,
    const lv_font_t * font_sub
    )
{
    mapping_config_container_t result = {0};

    // Row Object Widths
    int32_t label_width_0 = 80;
    int32_t value_width_0 = ((width_px/2) - label_width_0) - padding*2;
    int32_t label_width_1 = 80;
    int32_t value_width_1 = ((width_px/2) - label_width_1) - padding*2;
    int32_t label_width_2 = 80;
    int32_t value_width_2 = ((width_px/2) - label_width_2) - padding*2;

    int32_t obj_height = row_height-6;
    
    /* --- MAIN PANEL ------------------------------------------------------------------ */
    
    result.panel = lv_obj_create(scr);
    lv_obj_set_size(result.panel, width_px, height_px);
    lv_obj_align(result.panel, (lv_align_t)alignment, pos_x, pos_y);

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(result.panel, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(result.panel, LV_DIR_NONE);}
    
    // Panel style
    lv_obj_set_style_radius(result.panel, general_radius, LV_PART_MAIN);
    lv_obj_set_style_outline_width(result.panel, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.panel, default_outline_hue, LV_PART_MAIN);
    lv_obj_set_style_border_width(result.panel, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.panel, default_border_hue, LV_PART_MAIN);
    lv_obj_set_style_bg_color(result.panel, default_bg_hue, LV_PART_MAIN);
    lv_obj_set_style_pad_all(result.panel, padding, LV_PART_MAIN);
    lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_AUTO);
    lv_obj_set_flex_flow(result.panel, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(result.panel, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START);
    lv_obj_set_style_pad_row(result.panel, row_spacing, LV_PART_MAIN);
    lv_obj_set_style_radius(result.panel, radius, LV_PART_MAIN);
    lv_obj_set_style_outline_pad(result.panel, padding, LV_PART_MAIN);

    /* --- Slot ------------------------------------------------------- */
    lv_obj_t * row1 = lv_obj_create(result.panel);
    lv_obj_set_size(row1, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row1, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row1, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row1, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row1, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row1, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row1,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row1, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row1, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row1, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row1, LV_DIR_NONE);}

    label_width_0 = 150;
    value_width_0 = ((width_px/1) - label_width_0) - padding*4;
    
    result.slot = create_label(
        row1,                 // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Mape Mode",          // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );

