holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Always create a fresh screen
    printf("[display_gps_screen] creating screen object\n");
    gps_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    printf("[display_gps_screen] loading screen\n");
    lv_scr_load_anim(gps_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    printf("[display_gps_screen] creating default screen objects\n");
    create_default_screen_objects(gps_screen);

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gps_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // SATIO
    satio_c = create_satio_panel(
        gps_screen,       // parent
        480,              // width px
        400,              // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        50,                // pos y
        radius_rounded,   // radius
        8,                // padding
        34,               // row height
        6,                // row spacing
        true,             // show scrollbar
        true,             // enable scrolling
        &cobalt_alien_17, // font for titles,
        &cobalt_alien_17  // font for text,
    );

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gps_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // GNGGA
    gngga_c = create_gngga_panel(
        gps_screen,       // parent
        480,              // width px
        400,              // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        50,                // pos y
        radius_rounded,   // radius
        8,                // padding
        34,               // row height
        6,                // row spacing
        true,            // show scrollbar
        true,            // enable scrolling
        &cobalt_alien_17, // font for titles,
        &cobalt_alien_17  // font for text,
    );

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gps_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // GNRMC
    gnrmc_c = create_gnrmc_panel(
        gps_screen,       // parent
        480,              // width px
        400,              // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        50,                // pos y
        radius_rounded,   // radius
        8,                // padding
        34,               // row height
        6,                // row spacing
        true,            // show scrollbar
        true,            // enable scrolling
        &cobalt_alien_17, // font for titles,
        &cobalt_alien_17  // font for text,
    );

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gps_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // GPATT
    gpatt_c = create_gpatt_panel(
        gps_screen,       // parent
        480,              // width px
        400,              // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        50,                // pos y
        radius_rounded,   // radius
        8,                // padding
        34,               // row height
        6,                // row spacing
        true,            // show scrollbar
        true,            // enable scrolling
        &cobalt_alien_17, // font for titles,
        &cobalt_alien_17  // font for text,
    );

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gps_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // Switch Panel View
    switch_gps_panel = create_button(
        gps_screen,           // parent
        80,                   // width
        50,                   // height
        LV_ALIGN_LEFT_MID,    // alignment
        20, // pos x
        0, // pos y
        "GPS",                // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded
    );
    lv_obj_add_event_cb(switch_gps_panel.button, switch_gps_panel_event_cb, LV_EVENT_ALL, NULL);
}

/** ------------------------------------------------------------------
 * @brief Gyro Screen
 * 
 */
void display_gyro_screen()
{
    // Set Display Flag
    printf("[display_gyro_screen] setting display flag\n");
    flag_display_gyro_screen = false;

    // Check Current Screen
    printf("[display_gyro_screen] checking sctive screen\n");
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == gyro_screen) {
        printf("[display_gyro_screen] screen already active, returning\n");
        return;
    }
    printf("[display_gyro_screen] selected new screen, attempting to load new screen\n");

    // Always create a fresh screen
    printf("[display_gyro_screen] creating screen object\n");
    gyro_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    printf("[display_gyro_screen] loading screen\n");
    lv_scr_load_anim(gyro_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    printf("[display_gyro_screen] creating default screen objects\n");
    create_default_screen_objects(gyro_screen);

    printf("[display_gyro_screen] invalidating display\n");
    lv_obj_invalidate(gyro_screen);  // Force redraw
    printf("[display_gyro_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // SATIO
    gyro_0_c = create_gyro_panel(
        gyro_screen,      // parent
        480,              // width px
        400,              // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        50,               // pos y
        radius_rounded,   // radius
        8,                // padding
        34,               // row height
        6,                // row spacing
        true,             // show scrollbar
        true,             // enable scrolling
        &cobalt_alien_17, // font for titles,
        &cobalt_alien_17  // font for text,
    );

