holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
        // System Tray Local Time
        lv_label_set_text(system_tray.local_time, satioData.formatted_local_time_HHMMSS);
        lv_obj_set_style_text_color(system_tray.local_time, main_title_hue, LV_PART_MAIN);

        // System Tray Local Date
        lv_label_set_text(system_tray.local_date, satioData.formatted_local_short_date_DDMMYY);
        lv_obj_set_style_text_color(system_tray.local_date, main_title_hue, LV_PART_MAIN);

        // System Tray Human Date
        String human_date = String(satioData.local_wday_name) + " " + String(satioData.local_mday) + " " + String(satioData.local_month_name);
        // printf("human date: %s\n", human_date.c_str());
        lv_label_set_text(system_tray.human_date, human_date.c_str());
        lv_obj_set_style_text_color(system_tray.human_date, main_title_hue, LV_PART_MAIN);

        // GPS Sync
        if (satioData.gps_sync) {
            lv_obj_add_flag(system_tray.gps_signal_strength, LV_OBJ_FLAG_HIDDEN);
            lv_obj_remove_flag(system_tray.datetime_sync, LV_OBJ_FLAG_HIDDEN);
            lv_obj_set_style_outline_color(system_tray.datetime_sync, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(system_tray.datetime_sync, lv_color_make(0, 255, 0), LV_PART_MAIN);
        }
        // GPS Signal
        else {
            lv_obj_add_flag(system_tray.datetime_sync, LV_OBJ_FLAG_HIDDEN);
            lv_obj_remove_flag(system_tray.gps_signal_strength, LV_OBJ_FLAG_HIDDEN);
            String gps_signal_text = "" + String(gnggaData.satellite_count) + ":" + String(gnggaData.gps_precision_factor) + "";
            lv_obj_set_style_outline_color(system_tray.gps_signal_strength, main_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(system_tray.gps_signal_strength, main_title_hue, LV_PART_MAIN);
            lv_label_set_text(system_tray.gps_signal_strength, gps_signal_text.c_str());
        }

        // SD Card Mounted / Success Flag
        if (sdcardFlagData.success_flag==2) {
            lv_obj_set_style_outline_color(system_tray.sdcard_mounted, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(system_tray.sdcard_mounted, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_label_set_text(system_tray.sdcard_mounted, "ok");
        }
        else if (sdcardFlagData.success_flag==1) {
            lv_obj_set_style_outline_color(system_tray.sdcard_mounted, lv_color_make(255, 0, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(system_tray.sdcard_mounted, lv_color_make(255, 0, 0), LV_PART_MAIN);
            lv_label_set_text(system_tray.sdcard_mounted, "!");
        }
        else {
            if (sdcardData.sdcard_mounted) {
                lv_obj_set_style_outline_color(system_tray.sdcard_mounted, main_outline_hue, LV_PART_MAIN);
                lv_obj_set_style_text_color(system_tray.sdcard_mounted, main_title_hue, LV_PART_MAIN);
                lv_label_set_text(system_tray.sdcard_mounted, "SD");
            }
            else {
                lv_obj_set_style_outline_color(system_tray.sdcard_mounted, main_outline_hue, LV_PART_MAIN);
                lv_obj_set_style_text_color(system_tray.sdcard_mounted, main_title_hue, LV_PART_MAIN);
                lv_label_set_text(system_tray.sdcard_mounted, "SD!");
            }
        }

        // Grid Menu 1
        if (system_tray.grid_menu_1) {
            vTaskDelay(5 / portTICK_PERIOD_MS);

            uint32_t grid_child_cnt = lv_obj_get_child_cnt(system_tray.grid_menu_1);
            for(uint32_t i = 0; i < grid_child_cnt; i++) {
                lv_obj_t * btn = lv_obj_get_child(system_tray.grid_menu_1, i);
                lv_obj_set_style_outline_color(btn, main_contrast_outline_hue, LV_PART_MAIN);
                // Get label
                lv_obj_t * label = lv_obj_get_child(btn, 0);
                if(label && lv_obj_has_class(label, &lv_label_class)) {
                    // Color label
                    lv_obj_set_style_text_color(label, 
                        lv_color_hsv_to_rgb((current_hue + (i * 60)) % 360, 100, 100), LV_PART_MAIN);
                }
            }
        }
    }

    // ---------------------
    // loading screen
    // ---------------------
    if (lv_scr_act() == loading_screen) {
    }

    // ---------------------
    // main screen
    // ---------------------
    else if (lv_scr_act() == home_screen) {
    }

    // ---------------------
    // matrix screen
    // ---------------------
    else if (lv_scr_act() == matrix_screen) {

        // Matrix Overview Grid 1
        if (matrix_overview_grid_1) {
            vTaskDelay(5 / portTICK_PERIOD_MS);

            uint32_t grid_child_cnt = lv_obj_get_child_cnt(matrix_overview_grid_1);
            for(uint32_t i = 0; i < grid_child_cnt; i++) {
                lv_obj_t * btn = lv_obj_get_child(matrix_overview_grid_1, i);

                /* Computer Assist (yellow outline) */
                if (matrixData.computer_assist[0][i]==true) {lv_obj_set_style_outline_color(btn, lv_color_make(255, 255, 0), LV_PART_MAIN);}
                else {lv_obj_set_style_outline_color(btn, lv_color_make(58, 58, 58), LV_PART_MAIN);}

                lv_obj_t * label = lv_obj_get_child(btn, 0);
                if(label && lv_obj_has_class(label, &lv_label_class)) {

                    /* Switch Intention (blue text) */
                    if (matrixData.switch_intention[0][i]==true) {lv_obj_set_style_text_color(label, lv_color_make(0, 0, 255), LV_PART_MAIN);}
                    else {
                        /* Computer Intention (yellow text) */
                        if (matrixData.computer_intention[0][i]==true) {lv_obj_set_style_text_color(label, lv_color_make(255, 255, 0), LV_PART_MAIN);}
                        else {lv_obj_set_style_text_color(label, lv_color_make(58, 58, 58), LV_PART_MAIN);}
                    }
                }
            }
        }
        
        // Matrix Save Slot
        if (dd_matrix_file_slot_select) {
            for (int i=0; i<MAX_MATRIX_SLOTS; i++) {
                if (strcmp(satioFileData.current_matrix_filepath, satioFileData.matix_filepaths[i])==0) {
                    lv_dropdown_set_selected(dd_matrix_file_slot_select, i);
                    break;
                }
            }
            lv_dropdown_set_selected(dd_matrix_file_slot_select, current_matrix_function_i);
            lv_obj_set_style_outline_color(dd_matrix_file_slot_select, main_contrast_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(dd_matrix_file_slot_select, main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_outline_color(lv_dropdown_get_list(dd_matrix_file_slot_select), main_contrast_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(lv_dropdown_get_list(dd_matrix_file_slot_select), main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(lv_dropdown_get_list(dd_matrix_file_slot_select), main_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
            lv_obj_set_style_text_color(lv_dropdown_get_list(dd_matrix_file_slot_select), main_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);
        }

        // Matrix New
        if (matrix_new.panel) {
            lv_obj_set_style_outline_color(matrix_new.panel, main_contrast_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(matrix_new.label, main_contrast_title_hue, LV_PART_MAIN);
        }

        // Matrix Save
        if (matrix_save.panel) {
            lv_obj_set_style_outline_color(matrix_save.panel, main_contrast_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(matrix_save.label, main_contrast_title_hue, LV_PART_MAIN);
        }

        // Matrix Load
        if (matrix_load.panel) {
            lv_obj_set_style_outline_color(matrix_load.panel, main_contrast_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(matrix_load.label, main_contrast_title_hue, LV_PART_MAIN);
        }

        // Matrix Delete
        if (matrix_delete.panel) {
            lv_obj_set_style_outline_color(matrix_delete.panel, main_contrast_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(matrix_delete.label, main_contrast_title_hue, LV_PART_MAIN);
        }

        // Switch Main Matrix Panel (Matrix/Mapping)
        if (switch_matrix_mapping_panel.label) {
            if (current_matrix_panel_view==0) {lv_label_set_text(switch_matrix_mapping_panel.label, "MATRIX");}
            else if (current_matrix_panel_view==1) {lv_label_set_text(switch_matrix_mapping_panel.label, "MAP");}
            else {lv_label_set_text(switch_matrix_mapping_panel.label, "");}
            lv_obj_set_style_outline_color(switch_matrix_mapping_panel.panel, main_contrast_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(switch_matrix_mapping_panel.label, main_contrast_title_hue, LV_PART_MAIN);
        }
        
        // Matrix Configuration Panel
        if (current_matrix_panel_view==0) {
            if (mfc.panel) {

