holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                // ────────────────────────────────────────────────
                // Local Month Name
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_local_month_name, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_local_month_name, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_local_month_name, String(satioData.local_month_name).c_str());
                lv_obj_set_style_text_color(satio_c.val_local_month_name, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Formatted Local Time
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_formatted_local_time, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_formatted_local_time, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_formatted_local_time, String(satioData.formatted_local_time_HHMMSS).c_str());
                lv_obj_set_style_text_color(satio_c.val_formatted_local_time, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Formatted Local Date
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_formatted_local_date, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_formatted_local_date, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_formatted_local_date, String(satioData.formatted_local_date_DDMMYYYY).c_str());
                lv_obj_set_style_text_color(satio_c.val_formatted_local_date, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Local Unix Time (μs)
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_local_unixtime_us, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_local_unixtime_us, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_local_unixtime_us, String(satioData.local_unixtime_uS).c_str());
                lv_obj_set_style_text_color(satio_c.val_local_unixtime_us, main_contrast_value_hue, LV_PART_MAIN);

                vTaskDelay(5 / portTICK_PERIOD_MS);

                // ────────────────────────────────────────────────
                // Formatted RTC Sync Time
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_formatted_rtc_sync_time, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_formatted_rtc_sync_time, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_formatted_rtc_sync_time, String(satioData.formatted_rtc_sync_time).c_str());
                lv_obj_set_style_text_color(satio_c.val_formatted_rtc_sync_time, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Formatted RTC Sync Date
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_formatted_rtc_sync_date, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_formatted_rtc_sync_date, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_formatted_rtc_sync_date, String(satioData.formatted_rtc_sync_date_DDMMYYYY).c_str());
                lv_obj_set_style_text_color(satio_c.val_formatted_rtc_sync_date, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // RTC Sync Latitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_rtcsync_latitude, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_rtcsync_latitude, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_rtcsync_latitude, String(satioData.rtcsync_latitude).c_str());
                lv_obj_set_style_text_color(satio_c.val_rtcsync_latitude, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // RTC Sync Longitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_rtcsync_longitude, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_rtcsync_longitude, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_rtcsync_longitude, String(satioData.rtcsync_longitude).c_str());
                lv_obj_set_style_text_color(satio_c.val_rtcsync_longitude, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // RTC Sync Altitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_rtcsync_altitude, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_rtcsync_altitude, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_rtcsync_altitude, String(satioData.rtcsync_altitude).c_str());
                lv_obj_set_style_text_color(satio_c.val_rtcsync_altitude, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Formatted RTC Time
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_formatted_rtc_time, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_formatted_rtc_time, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_formatted_rtc_time, String(satioData.formatted_rtc_time).c_str());
                lv_obj_set_style_text_color(satio_c.val_formatted_rtc_time, main_contrast_value_hue, LV_PART_MAIN);

