holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                // ────────────────────────────────────────────────
                // Formatted RTC Date
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_formatted_rtc_date, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_formatted_rtc_date, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_formatted_rtc_date, String(satioData.formatted_rtc_date).c_str());
                lv_obj_set_style_text_color(satio_c.val_formatted_rtc_date, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // RTC Unix Time
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_rtc_unixtime, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_rtc_unixtime, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_rtc_unixtime, String(satioData.rtc_unixtime).c_str());
                lv_obj_set_style_text_color(satio_c.val_rtc_unixtime, main_contrast_value_hue, LV_PART_MAIN);

                vTaskDelay(5 / portTICK_PERIOD_MS);

                // ────────────────────────────────────────────────
                // UTC Second Offset
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_utc_second_offset, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_utc_second_offset, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_utc_second_offset, String(satioData.utc_second_offset).c_str());
                lv_obj_set_style_text_color(satio_c.val_utc_second_offset, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // UTC Auto Offset Flag
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_utc_auto_offset_flag, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_utc_auto_offset_flag, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_utc_auto_offset_flag, satioData.utc_auto_offset_flag ? "Yes" : "No");
                lv_obj_set_style_text_color(satio_c.val_utc_auto_offset_flag, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Set Time Automatically
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_set_time_automatically, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_set_time_automatically, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_set_time_automatically, satioData.set_time_automatically ? "Yes" : "No");
                lv_obj_set_style_text_color(satio_c.val_set_time_automatically, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Altitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_altitude, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_altitude, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_altitude, String(satioData.altitude).c_str());
                lv_obj_set_style_text_color(satio_c.val_altitude, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Altitude Converted
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_altitude_converted, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_altitude_converted, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_altitude_converted, String(satioData.altitude_converted).c_str());
                lv_obj_set_style_text_color(satio_c.val_altitude_converted, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Altitude Unit Mode
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_altitude_unit_mode, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_altitude_unit_mode, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_altitude_unit_mode, String(satioData.altitude_unit_mode).c_str());
                lv_obj_set_style_text_color(satio_c.val_altitude_unit_mode, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Altitude Conversion Mode
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_altitude_conversion_mode, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_altitude_conversion_mode, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_altitude_conversion_mode, String(satioData.altitude_conversion_mode).c_str());
                lv_obj_set_style_text_color(satio_c.val_altitude_conversion_mode, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Speed
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_speed, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_speed, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_speed, String(satioData.speed).c_str());
                lv_obj_set_style_text_color(satio_c.val_speed, main_contrast_value_hue, LV_PART_MAIN);

