holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                // ────────────────────────────────────────────────
                // Speed Converted
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_speed_converted, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_speed_converted, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_speed_converted, String(satioData.speed_converted).c_str());
                lv_obj_set_style_text_color(satio_c.val_speed_converted, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Speed Unit Mode
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_speed_unit_mode, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_speed_unit_mode, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_speed_unit_mode, String(satioData.speed_unit_mode).c_str());
                lv_obj_set_style_text_color(satio_c.val_speed_unit_mode, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Speed Conversion Mode
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_speed_conversion_mode, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_speed_conversion_mode, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_speed_conversion_mode, String(satioData.speed_conversion_mode).c_str());
                lv_obj_set_style_text_color(satio_c.val_speed_conversion_mode, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Ground Heading Name
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_ground_heading_name, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_ground_heading_name, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_ground_heading_name, String(satioData.ground_heading_name).c_str());
                lv_obj_set_style_text_color(satio_c.val_ground_heading_name, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Ground Heading
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_ground_heading, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_ground_heading, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_ground_heading, String(satioData.ground_heading).c_str());
                lv_obj_set_style_text_color(satio_c.val_ground_heading, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Ground Heading Mode
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_ground_heading_mode, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_ground_heading_mode, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_ground_heading_mode, String(satioData.ground_heading_mode).c_str());
                lv_obj_set_style_text_color(satio_c.val_ground_heading_mode, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Mileage
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_mileage, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_mileage, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_mileage, String(satioData.mileage).c_str());
                lv_obj_set_style_text_color(satio_c.val_mileage, main_contrast_value_hue, LV_PART_MAIN);
            }
        }

        else if (current_gps_panel==1) {
            if (gngga_c.panel) {
                // Hide
                // lv_obj_add_flag(gngga_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(gnrmc_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(gpatt_c.panel, LV_OBJ_FLAG_HIDDEN);
                // lv_obj_add_flag(satio_c.panel, LV_OBJ_FLAG_HIDDEN);

                // Show
                lv_obj_remove_flag(gngga_c.panel, LV_OBJ_FLAG_HIDDEN);

                vTaskDelay(5 / portTICK_PERIOD_MS);

                // Panel
                lv_obj_set_style_outline_color(gngga_c.panel, main_contrast_outline_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gngga_c.lbl_utc_time, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gngga_c.val_utc_time, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gngga_c.val_utc_time, String(gnggaData.utc_time).c_str());
                // lv_label_set_text(gngga_c.val_utc_time, "foobar");
                lv_obj_set_style_text_color(gngga_c.val_utc_time, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gngga_c.lbl_latitude, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gngga_c.val_latitude, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gngga_c.val_latitude, String(String(gnggaData.latitude_hemisphere) + " " + String(gnggaData.latitude)).c_str());
                lv_obj_set_style_text_color(gngga_c.val_latitude, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gngga_c.lbl_longitude, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gngga_c.val_longitude, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gngga_c.val_longitude, String(String(gnggaData.longitude_hemisphere) + " " + String(gnggaData.longitude)).c_str());
                lv_obj_set_style_text_color(gngga_c.val_longitude, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gngga_c.lbl_solution_status, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gngga_c.val_solution_status, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gngga_c.val_solution_status, String(gnggaData.solution_status).c_str());
                lv_obj_set_style_text_color(gngga_c.val_solution_status, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gngga_c.lbl_sat_count, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gngga_c.val_sat_count, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gngga_c.val_sat_count, String(gnggaData.satellite_count).c_str());
                lv_obj_set_style_text_color(gngga_c.val_sat_count, main_contrast_value_hue, LV_PART_MAIN);     
                
                lv_obj_set_style_text_color(gngga_c.lbl_gps_precision_factor, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gngga_c.val_gps_precision_factor, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gngga_c.val_gps_precision_factor, String(gnggaData.gps_precision_factor).c_str());
                lv_obj_set_style_text_color(gngga_c.val_gps_precision_factor, main_contrast_value_hue, LV_PART_MAIN);    
                
                lv_obj_set_style_text_color(gngga_c.lbl_altitude, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gngga_c.val_altitude, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gngga_c.val_altitude, String(String(gnggaData.altitude) + " " + String(gnggaData.altitude_units)).c_str());
                lv_obj_set_style_text_color(gngga_c.val_altitude, main_contrast_value_hue, LV_PART_MAIN);    

                lv_obj_set_style_text_color(gngga_c.lbl_geoidal, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gngga_c.val_geoidal, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gngga_c.val_geoidal, String(String(gnggaData.geoidal) + " " + String(gnggaData.geoidal_units)).c_str());
                lv_obj_set_style_text_color(gngga_c.val_geoidal, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gngga_c.lbl_differential_delay, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gngga_c.val_differential_delay, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gngga_c.val_differential_delay, String(gnggaData.differential_delay).c_str());
                lv_obj_set_style_text_color(gngga_c.val_differential_delay, main_contrast_value_hue, LV_PART_MAIN); 

