holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                lv_obj_set_style_text_color(gpatt_c.lbl_mis_att_flag, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_mis_att_flag, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_mis_att_flag, String(gpattData.mis_att_flag).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_mis_att_flag, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_imu_kind, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_imu_kind, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_imu_kind, String(gpattData.imu_kind).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_imu_kind, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_ubi_car_kind, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_ubi_car_kind, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_ubi_car_kind, String(gpattData.ubi_car_kind).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_ubi_car_kind, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_mileage, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_mileage, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_mileage, String(gpattData.mileage).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_mileage, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_run_inetial_flag, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_run_inetial_flag, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_run_inetial_flag, String(gpattData.run_inetial_flag).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_run_inetial_flag, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_speed_num, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_speed_num, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_speed_num, String(gpattData.speed_num).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_speed_num, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_scalable, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_scalable, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_scalable, String(gpattData.scalable).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_scalable, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_bad_element_count, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_bad_element_count, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_bad_element_count, String(gpattData.total_bad_elements).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_bad_element_count, main_contrast_value_hue, LV_PART_MAIN);
            }
        }
    }

    // ---------------------
    // Gyro screen
    // ---------------------
    else if (lv_scr_act() == gyro_screen) {
        vTaskDelay(5 / portTICK_PERIOD_MS);
        if (gyro_0_c.panel) {

            vTaskDelay(5 / portTICK_PERIOD_MS);

            lv_obj_set_style_outline_color(gyro_0_c.panel, main_contrast_outline_hue, LV_PART_MAIN);

            // ────────────────────────────────────────────────
            // Angular X
            // ────────────────────────────────────────────────
            lv_obj_set_style_text_color(gyro_0_c.lbl_gyro_0_ang_x, main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_outline_color(gyro_0_c.val_gyro_0_ang_x, main_contrast_value_hue, LV_PART_MAIN);
            lv_label_set_text(gyro_0_c.val_gyro_0_ang_x, String(gyroData.gyro_0_ang_x).c_str());
            lv_obj_set_style_text_color(gyro_0_c.val_gyro_0_ang_x, main_contrast_value_hue, LV_PART_MAIN);

            // ────────────────────────────────────────────────
            // Angular Y
            // ────────────────────────────────────────────────
            lv_obj_set_style_text_color(gyro_0_c.lbl_gyro_0_ang_y, main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_outline_color(gyro_0_c.val_gyro_0_ang_y, main_contrast_value_hue, LV_PART_MAIN);
            lv_label_set_text(gyro_0_c.val_gyro_0_ang_y, String(gyroData.gyro_0_ang_y).c_str());
            lv_obj_set_style_text_color(gyro_0_c.val_gyro_0_ang_y, main_contrast_value_hue, LV_PART_MAIN);

            // ────────────────────────────────────────────────
            // Angular Z
            // ────────────────────────────────────────────────
            lv_obj_set_style_text_color(gyro_0_c.lbl_gyro_0_ang_z, main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_outline_color(gyro_0_c.val_gyro_0_ang_z, main_contrast_value_hue, LV_PART_MAIN);
            lv_label_set_text(gyro_0_c.val_gyro_0_ang_z, String(gyroData.gyro_0_ang_z).c_str());
            lv_obj_set_style_text_color(gyro_0_c.val_gyro_0_ang_z, main_contrast_value_hue, LV_PART_MAIN);

            // ────────────────────────────────────────────────
            // Acceleration X
            // ────────────────────────────────────────────────
            lv_obj_set_style_text_color(gyro_0_c.lbl_gyro_0_acc_x, main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_outline_color(gyro_0_c.val_gyro_0_acc_x, main_contrast_value_hue, LV_PART_MAIN);
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_x, String(gyroData.gyro_0_acc_x).c_str());
            lv_obj_set_style_text_color(gyro_0_c.val_gyro_0_acc_x, main_contrast_value_hue, LV_PART_MAIN);

